<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"8b193f7818a4d172e5add3df2571e606b5f0b45480aa6f51eca30969f0c6fbb4","plan_job_ref":"Job Pull Request Checks #3222 at https://github.com/GSA-TTS/FAC/actions/runs/9624837953","plan_out_hash":"a480ff1accdaefc2daa39afff395ed9a4b33950da95e83fd6d7f878b5ec9db40","plan_hash":"d1b6976e535fdbf7ee61d4de233b5204b7b7bef4e395cec2a05a8b57aa938afb","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 7 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.staging.module.newrelic.newrelic_alert_policy.alert_policy will be created
+   resource "newrelic_alert_policy" "alert_policy" {
+       account_id          = (known after apply)
+       id                  = (known after apply)
+       incident_preference = "PER_POLICY"
+       name                = "staging-alert-policy"
    }

  # module.staging.module.newrelic.newrelic_notification_channel.email_channel will be created
+   resource "newrelic_notification_channel" "email_channel" {
+       account_id     = 3919076
+       active         = true
+       destination_id = (known after apply)
+       id             = (known after apply)
+       name           = "staging_email_notification_channel"
+       product        = "IINT"
+       status         = (known after apply)
+       type           = "EMAIL"

+       property {
+           key           = "subject"
+           value         = "{{issueTitle}}"
#            (2 unchanged attributes hidden)
        }
    }

  # module.staging.module.newrelic.newrelic_notification_destination.email_destination will be created
+   resource "newrelic_notification_destination" "email_destination" {
+       account_id = 3919076
+       active     = true
+       guid       = (known after apply)
+       id         = (known after apply)
+       last_sent  = (known after apply)
+       name       = "email_destination"
+       status     = (known after apply)
+       type       = "EMAIL"

+       property {
+           key           = "email"
+           value         = "daniel.swick@gsa.gov, matthew.jadud@gsa.gov, alexander.steel@gsa.gov"
#            (2 unchanged attributes hidden)
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.error_transactions will be created
+   resource "newrelic_nrql_alert_condition" "error_transactions" {
+       account_id                   = 3919076
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "Error Transactions (%)"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above"
+           threshold             = 5
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }

+       nrql {
+           query = "SELECT percentage(count(*), WHERE error is true) FROM Transaction"
        }

+       warning {
+           operator              = "above"
+           threshold             = 3
+           threshold_duration    = 300
+           threshold_occurrences = "all"
        }
    }

  # module.staging.module.newrelic.newrelic_nrql_alert_condition.infected_file_found will be created
+   resource "newrelic_nrql_alert_condition" "infected_file_found" {
+       account_id                   = (known after apply)
+       aggregation_delay            = "120"
+       aggregation_method           = "event_flow"
+       aggregation_window           = 60
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       fill_option                  = "static"
+       fill_value                   = 0
+       id                           = (known after apply)
+       name                         = "Infected File Found!"
+       policy_id                    = (known after apply)
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           operator              = "above_or_equals"
+           threshold             = 1
+           threshold_duration    = 300
+           threshold_occurrences = "at_least_once"
        }

+       nrql {
+           query = "SELECT count(*) FROM Log WHERE tags.space_name ='staging' and message LIKE '%ScanResult.INFECTED%'"
        }
    }

  # module.staging.module.newrelic.newrelic_one_dashboard.search_dashboard will be created
+   resource "newrelic_one_dashboard" "search_dashboard" {
+       account_id  = (known after apply)
+       guid        = (known after apply)
+       id          = (known after apply)
+       name        = "Search Dashboard (staging)"
+       permalink   = (known after apply)
+       permissions = "public_read_only"

+       page {
+           guid = (known after apply)
+           name = "Search"

+           widget_billboard {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Searches Per Hour"
+               width          = 3

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) as 'Total', rate(count(*), 1 minute) as 'Per Minute' FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-staging' since 1 hours AGO COMPARE WITH 1 week ago"
                }
            }

+           widget_line {
+               column         = 4
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 1
+               title          = "Search Traffic"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "SELECT count(*) FROM Transaction where request.uri like '%/dissemination/search%' and request.method = 'POST' and appName = 'gsa-fac-staging' since 4 hours AGO COMPARE WITH 1 week ago TIMESERIES"
                }
            }
+           widget_line {
+               column         = 1
+               height         = 3
+               id             = (known after apply)
+               legend_enabled = true
+               row            = 2
+               title          = "Search Response Time"
+               width          = 6

+               nrql_query {
+                   account_id = (known after apply)
+                   query      = "FROM Metric SELECT average(newrelic.timeslice.value) WHERE appName = 'gsa-fac-staging' WITH METRIC_FORMAT 'Custom/search' TIMESERIES SINCE 1 day ago COMPARE WITH 1 week ago"
                }
            }
        }
    }

  # module.staging.module.newrelic.newrelic_workflow.alert_workflow will be created
+   resource "newrelic_workflow" "alert_workflow" {
+       account_id            = (known after apply)
+       destinations_enabled  = true
+       enabled               = true
+       enrichments_enabled   = true
+       guid                  = (known after apply)
+       id                    = (known after apply)
+       last_run              = (known after apply)
+       muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES"
+       name                  = "staging_alert_workflow"
+       workflow_id           = (known after apply)

+       destination {
+           channel_id            = (known after apply)
+           name                  = (known after apply)
+           notification_triggers = (known after apply)
+           type                  = (known after apply)
        }

+       issues_filter {
+           filter_id = (known after apply)
+           name      = "filter"
+           type      = "FILTER"

+           predicate {
+               attribute = "labels.policyIds"
+               operator  = "EXACTLY_MATCHES"
+               values    = (known after apply)
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.staging.module.cg-logshipper.module.s3-logshipper-storage.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/staging.cg-logshipper.s3-logshipper-storage/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases

(and 4 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [Pull Request Checks #3222](https://github.com/GSA-TTS/FAC/actions/runs/9624837953)